# GetHostId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinforcement..::..GetHostId Method
PathReinforcement Class See Also
---
The element that contains the Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId GetHostId()
```

Visual Basic
---
```text
Public Function GetHostId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetHostId()
```

# ### Return Value
The element that the Path Reinforcement object belongs to, such as a structural wall, floor or foundation.
# See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace